/**
 * Created by qoder on 16-6-30.
 */
const nodeExcel = require('excel-export');
const ExcelTpl = require('../../../../library/excelTpl');

function getExcel(req, res, next) {
    var conf = {};
    // conf.stylesXmlFile = "styles.xml";
    conf.name = "mysheet";
    conf.cols = ExcelTpl;
    conf.rows = [
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上'],
        ['齐超','数学与统计学院','信息与计算科学','51432','5143209','841599872','秦皇岛昊锐科技有限公司','web','12123123123123123','招收前端','好好学习,天天向上']
    ];
    var result = nodeExcel.execute(conf);
    res.setHeader('Content-Type', 'application/vnd.openxmlformats');
    res.setHeader("Content-Disposition", "attachment; filename=" + "Report.xlsx");
    res.end(result, 'binary');
}

module.exports = getExcel;